rakechen-0307/Embedded-System/stm32FOC/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "dfsdm.h"
#include "dma.h"
#include "i2c.h"
#include "quadspi.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "usb_device.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <math.h>
#include "arm_math.h"
#include "math_helper.h"
#include "stm32l475e_iot01_accelero.h"
#include "AS5600.h"
#include "foc.h"
#include "usbd_customhid.h"
#include "keyboard.h"
#include "ugui.h"
#include "lcd.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#ifdef __GNUC__
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */

#define TEST_LENGTH_SAMPLES 320
#define SNR_THRESHOLD_F32 140.0f
#define BLOCK_SIZE 32
#define NUM_TAPS 29
// #define FIR_EXAMPLE
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
float sin_out[256];
float fft_mag[256];
float fft_out[256];
char msg[100];
int16_t pDataXYZ[3] = {0};

/* -------------------------------------------------------------------
 * The input signal and reference output (computed with MATLAB)
 * are defined externally in arm_fir_lpf_data.c.
 * ------------------------------------------------------------------- */

extern float32_t testInput_f32_1kHz_15kHz[TEST_LENGTH_SAMPLES];
extern float32_t refOutput[TEST_LENGTH_SAMPLES];

/* -------------------------------------------------------------------
 * Declare Test output buffer
 * ------------------------------------------------------------------- */

static float32_t testOutput[TEST_LENGTH_SAMPLES];
static float32_t testInput[TEST_LENGTH_SAMPLES];

/* -------------------------------------------------------------------
 * Declare State buffer of size (numTaps + blockSize - 1)
 * ------------------------------------------------------------------- */

static float32_t firStateF32[BLOCK_SIZE + NUM_TAPS - 1];

/* ----------------------------------------------------------------------
** FIR Coefficients buffer generated using fir1() MATLAB function.
** fir1(28, 6/24)
** ------------------------------------------------------------------- */

const float32_t firCoeffs32[NUM_TAPS] = {
    -0.0018225230f, -0.0015879294f, +0.0000000000f, +0.0036977508f, +0.0080754303f, +0.0085302217f, -0.0000000000f, -0.0173976984f,
    -0.0341458607f, -0.0333591565f, +0.0000000000f, +0.0676308395f, +0.1522061835f, +0.2229246956f, +0.2504960933f, +0.2229246956f,
    +0.1522061835f, +0.0676308395f, +0.0000000000f, -0.0333591565f, -0.0341458607f, -0.0173976984f, -0.0000000000f, +0.0085302217f,
    +0.0080754303f, +0.0036977508f, +0.0000000000f, -0.0015879294f, -0.0018225230f};

const float32_t myfirCoeffs32[NUM_TAPS] = {
    0.002473435810475501f, 0.003343127445659259f, 0.005336578223975353f, 0.008720202929326822f, 0.013628967885133642f, 0.02003713296555303f, 0.027746331317450117f, 0.036393180280610914f, 0.04547630443435468f, 0.054400296473695105f, 0.06253203866712877f, 0.06926322441214175f, 0.0740720610951766f, 0.07657711805931847f, 0.07657711805931847f, 0.0740720610951766f, 0.06926322441214175f, 0.06253203866712877f, 0.054400296473695126f, 0.045476304434354686f, 0.03639318028061092f, 0.02774633131745012f, 0.020037132965553033f, 0.013628967885133642f, 0.008720202929326822f, 0.005336578223975353f, 0.003343127445659259f, 0.002473435810475501f};

/* ------------------------------------------------------------------
 * Global variables for FIR LPF Example
 * ------------------------------------------------------------------- */

uint32_t blockSize = BLOCK_SIZE;
uint32_t numBlocks = TEST_LENGTH_SAMPLES / BLOCK_SIZE;

float32_t snr;

/* ------------------------------------------------------------------
 *                  USB
 * ------------------------------------------------------------------- */
extern USBD_HandleTypeDef hUsbDeviceFS;
/* ------------------------------------------------------------------
 *                  FOC
 * ------------------------------------------------------------------- */
float Kp = 8;
float Ki = 0;
float Kd = 0;
float Sensor_Angle;
static float target_angle = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
void int16_to_float(int16_t *a, float *b, int length);
void DSP_Test(void);
void LCD_test(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{

  /* USER CODE BEGIN 1 */
  uint16_t raw_angle;
  float angle;
  char msg[100];
  uint32_t i;
  arm_fir_instance_f32 S;
  arm_status status;
  float32_t *inputF32, *outputF32;

/* Initialize input and output buffer pointers */
#ifdef FIR_EXAMPLE
  inputF32 = &testInput_f32_1kHz_15kHz[0];
  outputF32 = &testOutput[0];
#endif
  inputF32 = &testInput[0];
  outputF32 = &testOutput[0];
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  BSP_ACCELERO_Init();
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  MX_SPI1_Init();
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_DFSDM1_Init();
  MX_I2C2_Init();
  MX_QUADSPI_Init();
  MX_SPI3_Init();
  MX_USART1_UART_Init();
  MX_USART3_UART_Init();
  MX_I2C1_Init();
  MX_TIM3_Init();
  MX_TIM6_Init();
  MX_USB_DEVICE_Init();
  /* USER CODE BEGIN 2 */
#ifdef FIR_EXAMPLE
  HAL_UART_Transmit(&huart1, (uint8_t *)inputF32, 320 * sizeof(float), HAL_MAX_DELAY);
  /* Call FIR init function to initialize the instance structure. */

  arm_fir_init_f32(&S, NUM_TAPS, (float32_t *)&firCoeffs32[0], &firStateF32[0], blockSize);

  /* ----------------------------------------------------------------------
  ** Call the FIR process function for every blockSize samples
  ** ------------------------------------------------------------------- */
  for (i = 0; i < numBlocks; i++)
  {
    arm_fir_f32(&S, inputF32 + (i * blockSize), outputF32 + (i * blockSize), blockSize);
  }
  HAL_UART_Transmit(&huart1, (uint8_t *)outputF32, 320 * sizeof(float), HAL_MAX_DELAY);

  /* ----------------------------------------------------------------------
  ** Compare the generated output against the reference output computed
  ** in MATLAB.
  ** ------------------------------------------------------------------- */

  snr = arm_snr_f32(&refOutput[0], &testOutput[0], TEST_LENGTH_SAMPLES);

  if (snr < SNR_THRESHOLD_F32)
  {
    status = ARM_MATH_TEST_FAILURE;
  }
  else
  {
    status = ARM_MATH_SUCCESS;
  }
  // arm_fir_init_f32(&S, NUM_TAPS, (float32_t *)&myfirCoeffs32[0], &firStateF32[0], blockSize);
#endif
  /* Call FIR init function to initialize the instance structure. */
  // sprintf(msg, "LCD start init\n", angle);
  // HAL_UART_Transmit(&huart1, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);
  // LCD_init();
  // sprintf(msg, "LCD init ended\n", angle);
  // HAL_UART_Transmit(&huart1, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);
  // LCD_test();
  // sprintf(msg, "LCD tested\n", angle);
  // HAL_UART_Transmit(&huart1, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);

  bsp_as5600Init();
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);
  AlignSensor();
  HAL_TIM_Base_Start_IT(&htim6);

  int Partition_Rev = 10;
  int Partition_Inx = 0;
  float angleArray[Partition_Rev];
  for (int i = 0; i < Partition_Rev; i++)
  {
    angleArray[i] = i * 2 * _PI / Partition_Rev;
  }
  float ThresholdArray[Partition_Rev - 1];
  for (int i = 0; i < Partition_Rev - 1; i++)
  {
    ThresholdArray[i] = (angleArray[i] + angleArray[i + 1]) / 2;
  }

  /* USER CODE END 2 */
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    angle = bsp_as5600GetWrappedAngle();
    sprintf(msg, "angle: %f\n", angle);
    HAL_UART_Transmit(&huart1, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);

    if (angle > ThresholdArray[Partition_Inx] && Partition_Inx < Partition_Rev - 1)
    {
      HAL_UART_Transmit(&huart1, "UP\n", 3, HAL_MAX_DELAY);
      Partition_Inx++;
      VOL_UP_FLAG = 1;
      target_angle = angleArray[Partition_Inx];
    }
    else if (angle < ThresholdArray[Partition_Inx - 1] && Partition_Inx > 0)
    {
      HAL_UART_Transmit(&huart1, "DOWN\n", 5, HAL_MAX_DELAY);
      Partition_Inx--;
      VOL_UP_FLAG = -1;
      target_angle = angleArray[Partition_Inx];
    }

    // volume_control(VOL_UP_FLAG);
    VOL_UP_FLAG = 0;
    sprintf(msg, "target_angle: %f\n", target_angle);
    HAL_UART_Transmit(&huart1, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);
    ClosedLoopPosition(Kp, Ki, Kd, target_angle);
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
   */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure LSE Drive Capability
   */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSE | RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 40;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    Error_Handler();
  }

  /** Enable MSI Auto calibration
   */
  HAL_RCCEx_EnableMSIPLLMode();
}

/* USER CODE BEGIN 4 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  // Check which version of the timer triggered this callback and toggle LED
  if (htim == &htim6)
  {
    // ClosedLoopPosition(Kp, Ki, Kd, target_angle);
    __NOP();
  }
}
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if (GPIO_Pin == GPIO_PIN_13)
  {
    HAL_GPIO_TogglePin(LED2_GPIO_Port, LED2_Pin);
  }
  else
  {
    __NOP();
  }
}

void int16_to_float(int16_t *a, float *b, int length)
{
  for (int i = 0; i < length; i++)
  {
    b[i] = (float)a[i];
  }
}
PUTCHAR_PROTOTYPE
{
  HAL_UART_Transmit(&huart1, (uint8_t *)&ch, 1, 0xFFFF);
  return ch;
}

void DSP_Test()
{
  arm_rfft_fast_instance_f32 S;

  for (uint16_t i = 0; i < 256; i++)
  {
    sin_out[i] = arm_sin_f32(i * 2 * 3.1416f / 128) + 0.3f * arm_sin_f32(i * 2 * 3.1416f / 16);
  }
  HAL_UART_Transmit(&huart1, (uint8_t *)sin_out, 256 * sizeof(float), HAL_MAX_DELAY);
}
void LCD_test()
{
  UG_FillScreen(C_BLACK);
  UG_FillFrame(70, 150, 170, 210, C_BLACK);
  LCD_PutStr(120 - 32, 150, "80", FONT_32X53, C_WHITE, C_BLACK);
  UG_DrawDashboard(120, 150, 100, 90, 0, 80, C_YELLOW);
  HAL_Delay(1000);
  UG_FillFrame(70, 150, 170, 210, C_BLACK);
  LCD_PutStr(120 - 32, 150, "60", FONT_32X53, C_WHITE, C_BLACK);
  UG_DrawDashboard(120, 150, 100, 90, 80, 60, C_BLACK);
  HAL_Delay(1000);
  UG_FillFrame(70, 150, 170, 210, C_BLACK);
  LCD_PutStr(120 - 48, 150, "100", FONT_32X53, C_WHITE, C_BLACK);
  UG_DrawDashboard(120, 150, 100, 90, 60, 100, C_YELLOW);
  HAL_Delay(1000);
  UG_FillFrame(70, 150, 170, 210, C_BLACK);
  LCD_PutStr(120 - 32, 150, "20", FONT_32X53, C_WHITE, C_BLACK);
  UG_DrawDashboard(120, 150, 100, 90, 100, 20, C_BLACK);
  HAL_Delay(1000);
}
/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
